#include <stdint.h>
// #include "hpm_interrupt.h"

#define LIKELY(x) __builtin_expect(!!(x), 1)
#define UNLIKELY(x) __builtin_expect(!!(x), 0)

#define set_csr(csr_num, bit) __asm volatile("csrs %0, %1" \
                                             :             \
                                             : "i"(csr_num), "r"(bit))
#define read_clear_csr(csr_num, bit) ({ volatile uint32_t v = 0; __asm volatile("csrrc %0, %1, %2" : "=r"(v) : "i"(csr_num), "r"(bit)); v; })

static inline void enable_global_irq(uint32_t mask)
{
    set_csr(0x300, mask);
}

static inline uint32_t disable_global_irq(uint32_t mask)
{
    return read_clear_csr(0x300, mask);
}

#define __R volatile const /* Define "read-only" permission */
#define __RW volatile      /* Define "read-write" permission */
#define __W volatile       /* Define "write-only" permission */

typedef struct
{
    struct
    {
        __R uint32_t VALUE;        /* 0x0: GPIO input value */
        __R uint8_t RESERVED0[12]; /* 0x4 - 0xF: Reserved */
    } DI[15];
    __R uint8_t RESERVED0[16]; /* 0xF0 - 0xFF: Reserved */
    struct
    {
        __RW uint32_t VALUE;  /* 0x100: GPIO output value */
        __RW uint32_t SET;    /* 0x104: GPIO output set */
        __RW uint32_t CLEAR;  /* 0x108: GPIO output clear */
        __RW uint32_t TOGGLE; /* 0x10C: GPIO output toggle */
    } DO[15];
    __R uint8_t RESERVED1[16]; /* 0x1F0 - 0x1FF: Reserved */
    struct
    {
        __RW uint32_t VALUE;  /* 0x200: GPIO direction value */
        __RW uint32_t SET;    /* 0x204: GPIO direction set */
        __RW uint32_t CLEAR;  /* 0x208: GPIO direction clear */
        __RW uint32_t TOGGLE; /* 0x20C: GPIO direction toggle */
    } OE[15];
    __R uint8_t RESERVED2[16]; /* 0x2F0 - 0x2FF: Reserved */
    struct
    {
        __W uint32_t VALUE;        /* 0x300: GPIO interrupt flag value */
        __R uint8_t RESERVED0[12]; /* 0x304 - 0x30F: Reserved */
    } IF[15];
    __R uint8_t RESERVED3[16]; /* 0x3F0 - 0x3FF: Reserved */
    struct
    {
        __RW uint32_t VALUE;  /* 0x400: GPIO interrupt enable value */
        __RW uint32_t SET;    /* 0x404: GPIO interrupt enable set */
        __RW uint32_t CLEAR;  /* 0x408: GPIO interrupt enable clear */
        __RW uint32_t TOGGLE; /* 0x40C: GPIO interrupt enable toggle */
    } IE[15];
    __R uint8_t RESERVED4[16]; /* 0x4F0 - 0x4FF: Reserved */
    struct
    {
        __RW uint32_t VALUE;  /* 0x500: GPIO interrupt polarity value */
        __RW uint32_t SET;    /* 0x504: GPIO interrupt polarity set */
        __RW uint32_t CLEAR;  /* 0x508: GPIO interrupt polarity clear */
        __RW uint32_t TOGGLE; /* 0x50C: GPIO interrupt polarity toggle */
    } PL[15];
    __R uint8_t RESERVED5[16]; /* 0x5F0 - 0x5FF: Reserved */
    struct
    {
        __RW uint32_t VALUE;  /* 0x600: GPIO interrupt type value */
        __RW uint32_t SET;    /* 0x604: GPIO interrupt type set */
        __RW uint32_t CLEAR;  /* 0x608: GPIO interrupt type clear */
        __RW uint32_t TOGGLE; /* 0x60C: GPIO interrupt type toggle */
    } TP[15];
    __R uint8_t RESERVED6[16]; /* 0x6F0 - 0x6FF: Reserved */
    struct
    {
        __RW uint32_t VALUE;  /* 0x700: GPIO interrupt asynchronous value */
        __RW uint32_t SET;    /* 0x704: GPIO interrupt asynchronous set */
        __RW uint32_t CLEAR;  /* 0x708: GPIO interrupt asynchronous clear */
        __RW uint32_t TOGGLE; /* 0x70C: GPIO interrupt asynchronous toggle */
    } AS[15];
    __R uint8_t RESERVED7[16]; /* 0x7F0 - 0x7FF: Reserved */
    struct
    {
        __RW uint32_t VALUE;  /* 0x800: GPIO dual edge interrupt enable value */
        __RW uint32_t SET;    /* 0x804: GPIO dual edge interrupt enable set */
        __RW uint32_t CLEAR;  /* 0x808: GPIO dual edge interrupt enable clear */
        __RW uint32_t TOGGLE; /* 0x80C: GPIO dual edge interrupt enable toggle */
    } PD[15];
} GPIO_Type;

/* FGPIO base address */
#define HPM_FGPIO_BASE (0xC0000UL)
/* FGPIO base pointer */
#define HPM_FGPIO ((GPIO_Type *)HPM_FGPIO_BASE)

#define PIN_SWCLK_BITFLD (27)
#define PIN_SWDIO_IN_BITFLD (28)
#define PIN_SWDIO_BITFLD (29)
#define PIN_SWDIR_BITFLD (30)

#define PIN_SWCLK_OFFSET (1 << PIN_SWCLK_BITFLD)
#define PIN_SWDIO_OFFSET (1 << PIN_SWDIO_BITFLD)
#define PIN_SWDIR_OFFSET (1 << PIN_SWDIR_BITFLD)

#define DAP_TRANSFER_OK (1U << 0)
#define DAP_TRANSFER_WAIT (1U << 1)
#define DAP_TRANSFER_FAULT (1U << 2)

static inline uint8_t GetParity(uint32_t data)
{
    data ^= data >> 16;
    data ^= data >> 8;
    data ^= data >> 4;
    data &= 0x0F;
    return (0x6996 >> data) & 1;
}

uint8_t SWD_Write_Opt_10M(uint8_t header,
                          uint8_t turnaround,
                          uint8_t data_phase,
                          uint8_t idle_cycles,
